#include <stdio.h>

int main(void)
{
	// 다차원 배열 Multidimensional Array
	int i; 
	//ㅁ
	
	int arr[5];
	// ㅁㅁㅁㅁㅁ
	
	int arr2[2][5] = { 
		{1,2,3,4,5}, 
		{1,2,3,4,5} 
	};
	//ㅁㅁㅁㅁㅁ
	//ㅁㅁㅁㅁㅁ
	
	//arr2[0][0] arr2[0][1] arr2[0][2] arr2[0][3] arr2[0][4]
	//arr2[1][0] arr2[1][0] arr2[1][0] arr2[1][0] arr2[1][0]
	
	int arr3[4][2];
	//ㅁㅁ
	//ㅁㅁ
	//ㅁㅁ
	//ㅁㅁ
	
	
	
	int arr4[3][3][3] = {
		{
			{1,2,3},
			{1,2,3},
			{1,2,3}
		},
		{
			{1,2,3},
			{1,2,3},
			{1,2,3}
		},
		{	
			{1,2,3},
		 	{1,2,3},
		 	{1,2,3}
		}
	};
	//ㅁㅁㅁ
	//ㅁㅁㅁ
	//ㅁㅁㅁ
	
	//ㅁㅁㅁ
	//ㅁㅁㅁ
	//ㅁㅁㅁ
	
	//ㅁㅁㅁ
	//ㅁㅁㅁ
	//ㅁㅁㅁ
	
	return 0;
}